Artillery/postRequest.yml
config:
  target: 'http://localhost:3001'
  processor: "./processors.js"
  phases:
    - duration: 5
      arrivalRate: 1000
scenarios:
  - flow:
    - function: "post"
    - post:
        url: "/api/apps"
        json:
          appid: "{{appid}}"
          relatedappid: "{{relatedappid}}"
          name: "{{name}}"
          logo: "{{logo}}"
          company: "{{company}}"
          rating: "{{rating}}"
          description: "{{description}}"